In [2]:
import pandas as pd

df=pd.read_csv('reviews_trust.csv')
df.head()

,Commentaire,star,date,client,reponse,source,company,ville,maj,date_commande,ecart
0,"Bonjour , Ca doit faire 5 ans environ que je s...",1,2021-06-20 00:00:00+00:00,AUDREY Du 62,NaN,TrustPilot,ShowRoom,NaN,NaN,NaN,NaN
1,Vente lacoste article manquant photo prise sur...,1,2021-06-20 00:00:00+00:00,Nanasky De Verteuil,NaN,TrustPilot,ShowRoom,NaN,NaN,NaN,NaN
2,"Vente Lacoste Honteuse , article erroné , arti...",1,2021-06-19 00:00:00+00:00,Vanessa L,NaN,TrustPilot,ShowRoom,NaN,NaN,NaN,NaN
3,J'ai commandé des mules de la marque Moosefiel...,2,2021-06-19 00:00:00+00:00,Valery PERRAULT,"Bonjour , Je suis sincèrement navré d'apprendr...",TrustPilot,ShowRoom,NaN,NaN,NaN,NaN
4,Commande téléphone etat A+ . Livraison d un vi...,1,2021-06-19 00:00:00+00:00,JULIE DRINGENBERG,"Bonjour Julie , Je suis sincèrement désolé de ...",TrustPilot,ShowRoom,NaN,NaN,NaN,NaN

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19863 entries, 0 to 19862
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Commentaire    19834 non-null  object
 1   star           19863 non-null  int64
 2   date           19488 non-null  object
 3   client         10215 non-null  object
 4   reponse        8477 non-null   object
 5   source         19863 non-null  object
 6   company        19863 non-null  object
 7   ville          4860 non-null   object
 8   maj            5 non-null      object
 9   date_commande  6686 non-null   object
 10  ecart          6686 non-null   float64
dtypes: float64(1), int64(1), object(9)
memory usage: 1.7+ MB
None

In [4]:
df.isnull().sum(axis=0)

Commentaire         29
star                 0
date               375
client            9648
reponse          11386
source               0
company              0
ville            15003
maj              19858
date_commande    13177
ecart            13177
dtype: int64

In [5]:
df.describe()

               star        ecart
count  19863.000000  6686.000000
mean       3.408398    14.286419
std        1.650531    10.373320
min        1.000000     1.000000
25%        1.000000     9.000000
50%        4.000000    12.000000
75%        5.000000    17.000000
max        5.000000   304.000000